[
  {
    "link": "https://www.coindesk.com/markets/2023/09/14/bitcoin-onchain-data-show-bullish-undercurrents/",
    "type": "news article",
    "title": "Bitcoin Onchain Data Show Bullish Undercurrents",
    "summary": "The market may appear boring, but under the surface, the onchain data is quietly aligning in favor of the bulls.",
    "content": "Bullish bitcoin (BTC) undercurrents lurk below the boringly calm crypto waters, setting the stage for a potential outsized price rally.\nThe percentage of bitcoin's circulating supply active onchain within the last month fell to a record low of 5.4% early this week, according to Blockware Solutions and Glassnode. In other words, fewer coins are changing hands, indicating supply-side weakness. At press time, bitcoin's circulating supply was 19.48 million.\n\"Price is set at the margin, which means those who trade Bitcoin back and forth drive short-term price action. As supply-side illiquidity continues to increase, as indicated by fewer supply exchanging hands, any demand catalyst will send the price skyrocketing,\" Blockware Solutions said in an email.\nThe percentage of circulating supply that has remained inactive for over a year stands near 70%.\nBuy and hold remains a preferred strategy in the crypto market, with the so-called long-term holders controlling over 75% of the circulating supply. Glassnode defines long-term holders as addresses that hold coins for at least 155 days.\nAwaiting bullish catalysts\nBesides the potential spot bitcoin-exchange-traded fund (ETF) launch, which is several months away, macro and regulatory concerns favor the bears.\n\"The macro scenario has never been murkier and the 'higher for longer' general mood could keep a lid on risk assets, including crypto,\" David Lawant, head of research at FalconX, said in a note to subscribers on Tuesday.\n\"There's also some potential selling pressure coming from government-seized wallets, chapter 11 portfolios, and large token unlocks over the next 6-12 months. Finally, there's uncertainty on whether more regulatory action is coming in the U.S.,\" Lawant added.",
    "date": "2023-09-14",
    "author": "omkar godbole",
    "tagList": [
      "bitcoin",
      "blockchain"
    ]
  },
  {
    "link": "https://www.coindesk.com/tech/2024/01/11/ethereums-vitalik-buterin-proposes-gas-limit-increase/",
    "type": "news article",
    "title": "Ethereum's Vitalik Buterin Proposes Gas Limit Increase",
    "summary": "Ethereum's gas limit refers to the maximum amount of gas that can be expended in an individual block. A limit increase could improve network capacity and potentially reduce costs for users.",
    "content": "Ethereum co-founder Vitalik Buterin suggested raising the network's gas limit by 33% on Wednesday – a move that would raise the network's transaction capacity and could reduce fees for end-users, but could increase operational costs for validators.\nUsers of the Ethereum blockchain pay gas fees to ensure that their transactions are added to the network, and the gas that one pays to execute a transaction roughly correlates to its computational complexity (e.g. a simple token swap will cost less gas than opening up a convoluted lending position).\nEthereum's gas limit refers to the total amount of gas that can be squeezed into an individual Ethereum block – the bundles of transactions that get added to the Ethereum network at regular intervals. Increasing the gas limit would mean increasing the amount (and complexity) of transactions that can be added to a block.\nButerin made the gas increase suggestion during a Reddit \"Ask Me Anything\" session featuring the Ethereum Foundation Research group.\n\"The gas limit has not been increased for nearly three years, which is the longest time ever in the protocol's history,\" Buterin wrote in response to a commenter who asked whether Ethereum could \"safely increase\" its gas limit. Buterin suggested increasing the gas limit to 40 million gas units – a 33% increase over today's 30 million limit.\nA ramp-up in Ethereum's gas limit wouldn't require a big update or \"hard fork\" of the network's core code. Instead, the validators that operate the network should be able to implement the change by adjusting certain parameters in their node software.\nCalls for increasing the gas limit started back in December when some of Ethereum's layer 2 (L2) networks were experiencing record usage. Martin Köppelmann, the co-founder of Gnosis Chain, wrote on X that for “Ethereum to become a settlement layer for L2s it needs to increase its block gas limit.”\nFollowing Buterin’s Reddit comments on Wednesday, more users on X, the platform formerly known as Twitter, chimed in with words of support for the suggested increase. Jesse Pollak, the head of protocols at Coinbase and creator of the layer-2 blockchain Base, shared his support of the move and suggested the gas limit could even be increased even further, to 45 million.\nOthers expressed more caution about the gas change, like Ethereum core developer Dankrad Feist, who suggested that calldata and blobs per block should be targeted in addition to the overall gas limit.\nAs for what the limit increase accomplishes, \"it simply allows more activity on L1 - it will either reduce tx costs - or more likely IMO just increase capacity at similar cost -> more burn,” said Köppelmann.",
    "date": "2024-01-11",
    "author": "sam kessler",
    "tagList": [
      "ethereum",
      "vitalik buterin",
      "gas fees",
      "blockchain",
      "validators"
    ]
  },
  {
    "link": "https://www.coindesk.com/tech/2023/08/31/swift-chainlink-tokenization-experiment-successfully-transfers-value-across-multiple-blockchains/",
    "type": "news article",
    "title": "Swift, Chainlink Tokenization Experiment Successfully Transfers Value Across Multiple Blockchains",
    "summary": "The interbank messaging system Swift announced in June it was collaborating with Chainlink and dozens of financial institutions to test connecting blockchains.",
    "content": "Interbank messaging system Swift and Web3 services platform Chainlink have successfully transferred tokenized value across multiple private and public blockchains in recent experiments, a Thursday press release said.\n\"The findings have potential to remove significant friction slowing the growth of tokenized asset markets and enable them to scale globally as they mature,\" the press release said.\nIn June Chainlink and Swift announced that they would be collaborating with dozens of financial institutions to test how they can connect with multiple blockchain networks. BNP Paribas, BNY Mellon, The Depository Trust & Clearing Corporation and Lloyds Banking Group and others collaborated with Swift on the experiments.\nFinancial institutions around the world are increasingly experimenting with asset tokenization with the goal of improving financial markets. A recent report from the Hong Kong Monetary Authority said tokenization could help improve efficiency and transparency in bond markets.\n\"For tokenization to reach its potential, institutions will need to be able to seamlessly connect with the whole financial ecosystem. Our experiments have demonstrated clearly that existing secure and trusted Swift infrastructure can provide that central point of connectivity, removing a huge hurdle in the development of tokenization and unlocking its potential,\" Tom Zschach, chief innovation officer at Swift said in a press statement.\nSwift used Chainlink's Cross-Chain Interoperability Protocol (CCIP) to connect with different blockchains. Chainlink’s CCIP, which is designed to help build cross-chain applications and services, went live in July.\nA report on the Chainlink and Swift experiments emphasized the need for regulatory clarity on tokenization and said that future work will require a greater focus on data privacy.\nUPDATE (Aug. 31, 13:44 UTC): Adds detail from report in last paragraph.",
    "date": "2023-08-31",
    "author": "camomile shumba",
    "tagList": [
      "chainlink",
      "swift",
      "blockchain"
    ]
  },
  {
    "link": "https://www.coindesk.com/business/2023/10/05/blockticity-mints-hemp-and-cannabis-certifications-on-avalanche/",
    "type": "news article",
    "title": "Blockticity Mints Hemp and Cannabis Certifications on Avalanche",
    "summary": "The process works by Blockticity printing a QR code on a product and the QR code then links to a Certificate of Analysis minted as an Avalanche NFT.",
    "content": "Blockticity, a startup that focuses on providing certificates of authenticity for possessions through blockchain, has minted certifications for $275 million in products on layer 1 Avalanche, according to a press release. The first round of minting includes hemp, psychedelic mushrooms and kratom.\nThe minting is done through its Certificate of Analysis (COA) as a non-fungible token (NFT) verification system. The first minting includes hemp, psychedelic mushrooms and kratom for U.S. hemp and cannabis lab, ACS Laboratory. The hemp, cannabis, mushroom and Kratom industry faces supply chain transparency challenges according to the company’s website. ACS tests for potency, assurance of no chemicals or pesticides in the products.\np0x Labs Co-Founder on Developer Adoption of AI\nThe aim of minting the certifications is to allow users to trace the COAs back to the original laboratory, access product’s test results and avoid fraudsters from exploiting the COAs through QR code tampering or data alterations, the press release read.\nSundie Seefried, CEO and president of Safe Harbor Financial, previously said in an interview with CoinDesk that a regulator expressed to her that crypto and cannabis could be a good match because blockchain technology provides a good traceability factor for funds derived from cannabis plants.\nThe way that the process works is Blockticity prints a QR code on the products and the QR code then links to a COA minted as an Avalanche NFT. So far, ACS Labratory has used Blockticty to mint over 35,000 COAs which accounts to a value of around $275 million.\nThrough minting a COA onto blockchain that is coming from the lab, Blockticity authenticates the report from the lab. Companies can then look up a COA and use the QR code to find that report owned by the firm who paid to perform the test, according to a previous statement.\nACS Laboratory’s next 120,000 scheduled COAs are for cannabis, according to the press release.\n“We’re pleased to join forces with Blockticity once again, harnessing this avant-garde technology for our esteemed clients,” said Roger Brown, president of ACS Laboratory. “This technological leap allows any COA viewer to trace its origins and detect any discrepancies.”\nACS Laboratory and Blockticity previously collaborated in November 2021 to launch its first national hemp COA as an NFT on the NFT platform Moonwalk.",
    "date": "2023-10-05",
    "author": "lyllah ledesma",
    "tagList": [
      "blockchain",
      "cannabis"
    ]
  },
  {
    "link": "https://www.coindesk.com/tech/2024/02/01/protocol-latest-tech-news-crypto-blockchain/",
    "type": "news article",
    "title": "Protocol Village: Metis, Ethereum Layer 2, Launches 'Liquid Staking Blitz'",
    "summary": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 1-7.",
    "content": "Feb. 7: Layer-2 network Metis launched the \"Metis Liquid Staking Blitz (LSB), an initiative to bolster their LSD ecosystem and accelerate the growth of LSDs and LSD-focused products on their Layer 2 network and leveraging the 4.6M METIS Ecosystem Development Fund,\" according to the team: \"Metis’ LSB will create the first LSD for a layer-2 network’s native token, unlocking LSDs’ versatility and blending it with the Layer 2 network’s profit and growth potential. For the first 12 months, a 20% Mining Rewards Rate (the rate at which smart contracts reward lockers for block production) will apply to all sequencer nodes.\"\nZengo Wallet Now Supports Layer-2 Network Arbitrum One\nFeb. 7: Zengo’s support for Arbitrum One \"is a big moment for the community, as it offers a seamless gateway to Zengo’s renowned security and user-friendly experience,\" according to the team: \"Zengo’s impeccable record of zero hacks or thefts since launch in 2018 (with over 1 million customers) is especially exciting for the Arbitrum One community, as they can now manage their assets with unparalleled security and engage in the ecosystem without the traditional complexities associated with seed phrases.\"\nPaxos Adopts Chainlink’s PayPal USD Price Feed to Accelerate RWAs\nFeb. 7: To accelerate the adoption of PayPal USD (PYUSD), PayPal’s USD-backed stablecoin issued by Paxos, Chainlink now supports a PYUSD Chainlink Price Feed on Ethereum mainnet, according to the team: \"This new PYUSD Price Feed allows users to view highly accurate, reliable and decentralized market data for PYUSD on the blockchain. This provides users the information needed to help create secure markets around PYUSD and adopt it as their preferred stablecoin to facilitate on-chain payments.\" CoinDesk 20 asset: {LINK}\nSolana-Based Neon EVM Integrates With deBridge for Cross-Chain\nFeb. 7: Neon EVM, a parallelized Ethereum Virtual Machine on Solana, and deBridge are officially integrating for cross-chain interoperability, according to the team: \"The blockchain interoperability market, expected to reach $2.8 billion by 2032, has adoption barriers due to user experience complexities. This integration is a streamlined solution. Users can bridge tokens directly to enhance the overall user experience by eliminating unnecessary intermediary steps and constraints. This has the potential to provide access to Ethereum's $32.5 billion Total Value Locked (TVL) as of 1/30/2024. For Neon EVM's devs, it gives a direct gateway for interoperability with EVM-native chains.\" CoinDesk 20 asset: {SOL}\nOP Labs Hires Former Consensys Developer Ben Edgington as Lead Technical Program Manager\nFeb. 7: OP Labs, the primary developer firm behind the Optimism blockchain, has brought on Ben Edgington as lead technical program manager. Edgington was previously at Consensys for over six years, where he founded their Protocols R&D team, and was part of the core group in charge of developing Teku, an Ethereum software client.\nSolana-Based Digital Art Marketplace Exchange.art Appoints Laris Barbu as CEO\nFeb. 7: Exchange.art, a digital art marketplace on Solana, has appointed Larisa Barbu as CEO, \"marking the first female to lead an on-chain marketplace,\" according to the team: \"Focused on broader digital art adoption, Larisa plans to forge strategic partnerships and drive Exchange.art to be the premier digital hub for fine art. Larisa's interim leadership showcased adaptability and resilience throughout the bear market. In Q4 the platform had a 1,000% sales increase, outperforming competitors. This success positions Larisa to confidently lead through future industry volatility, entering her role during a promising market rebound.\"\nVoi Network Launches as 'Iteration' of Algorand's Open-Source Code\nFeb. 7: Voi Network has been launched by veteran members of the Algorand proof-of-stake blockchain ecosystem, as a new iteration of the open-source code, according to the team: \"The development of Voi, a layer-1 blockchain that will be launching in Q2, was fueled by the team's frustration with the current shortcomings of the crypto industry. In response, Voi will allocate a significant 75% of its market cap to provide economic incentives for its network contributors and almost 800 participation nodes.\" The project disclosed in December that it was backed by Arrington Capital, an original investor in Algorand, as well as Sonic Boom Ventures, founded by former Algorand Inc. CEO Steve Kokinos.\nProtocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.\nDeFi Credit Marketplace Clearpool Launches on Mantle Network\nFeb. 6: Clearpool, the leading DeFi credit marketplace powered by its native token, $CPOOL, has \"announced its successful launch on Mantle Network, a layer 2 rollup that combines Ethereum's security with cheaper gas fees and higher throughput,\" according to the team. \"Clearpool has received a significant grant of 250K MNT tokens – dedicated to promoting Clearpool's growth on Mantle. Continuing with the impressive expansion of its borrower ecosystem, Clearpool also announces two new borrowers, Arbelos Markets and Adaptive Frontier, who are launching permissionless pools on the Clearpool Mantle Market.\"\nOmega Announces $6M in Funding to Launch Bitcoin Web3 Infrastructure\nFeb. 6: Omega announces $6M in funding from investors including Lightspeed Faction, Bankless Ventures, Wave Digital and more. According to the team: \"The funding will be used to help launch Omega’s Bitcoin Web3 infrastructure – the first decentralized solution that enables bitcoin holders to utilize the value of their Layer 1 BTC for yield generation without having to bridge, wrap or synthesize it, allowing native Bitcoin to be used for DeFi.\" CoinDesk 20 asset: {BTC}\nCitrea, by Chainway Labs, Emerges From Stealth as 'Bitcoin's First ZK Rollup'\nFeb. 6: Citrea, incubated by Chainway Labs and billed as \"Bitcoin's first ZK rollup,\" emerged from stealth. As reported by CoinDesk Turkiye: \"Ekrem Bal, co-founder of Chainway Labs, stated that they have made important progress with the verification of the groth16 proof of this technology on BitVM in 20B cycles, and emphasized that this progress represents an 'amazing milestone' for the Bitcoin ecosystem. By strengthening the Bitcoin blockchain space with zero-knowledge technology, Citrea aims to enable more complex applications while maintaining the security of the Bitcoin network. This technology offers a way to scale Bitcoin without changing its fundamental principles.\"\nRadix Releases Wallet Update, Triggers 'Anemone' Upgrade on Mainnet\nFeb. 6: Radix, a platform for DeFi and Web3, released two updates this week. According to the team, Radix \"has launched its v1.4.0 version of the Radix Wallet, which aims to improve the network staking experience. The update introduces an at-a-glance summary of a user’s total stakes, un-stakes and claims, rather than showing these as raw transaction manifests as it did previously. Additionally, Radix also launched its Anemone upgrade on mainnet. The upgrade includes support for new protocol update features such as the flash transaction type, system API extensions, protocol update thresholds, and node monitoring enhancements.\"\nOasys to Integrate With NFT Marketplace X2Y2\nFeb. 6: Oasys, a blockchain gaming ecosystem, \"is joining forces with X2Y2, an NFT marketplace platform, to integrate their X2Y2 Pro NFT aggregator,\" according to the team: \"The integration brings numerous advantages to both gamers and developers. Players will gain enhanced capabilities to trade and lend their in-game NFTs, while developers will have the ability to leverage X2Y2 Pro to create more engaging and dynamic economies. Gaming platforms already involved are Gesoten by GMO, DM2 Verse (user base of 41 million members and part of DMM Group), HOME Verse (operated by publicly traded company double jump.tokyo Inc.).\"\nRailway Wallet Open-Sources Code Under GPL v2 License\nFeb. 6: Railway Wallet has made its code fully open-source under a GPL v2 License, clearing the way for Ethereum developers to build their own robust privacy wallets and apps, according to the team: \"Named by Ethereum co-founder Vitalik Buterin as a promising 'second-generation' privacy product, the Railway privacy wallet is the most popular frontend for the RAILGUN privacy system for Ethereum and EVM chains. Railway’s move comes in response to Buterin’s call to 'make Ethereum cypherpunk again.' View and download the code at: https://github.com/Railway-Wallet.\"\nTruflation, Provider of Economic Data Via Chainlink, Raises $6M\nFeb. 6: Truflation, a provider of verifiable economic data that makes data available on-chain via Chainlink, has closed a funding round, raising $6 million from leading crypto investors, according to the team: \"The list of VCs includes Laser Digital, Red Beard Ventures, Modular Capital, Abra, G20 and Four Seasons Ventures (4SV), alongside existing investors Chainlink, Fundamental Labs, C2squared, Cogitent Ventures, and the Israeli Blockchain Association. The investment round also saw the Base Ecosystem Fund, managed by Coinbase Ventures, select Truflation among its first cohort of investments from a shortlist of more than 800 applications.\" CoinDesk 20 asset: {LINK}\nReflexer Team Says HAI Stablecoin Set for Optimism Mainnet, Airdrop\nFeb. 6: The team behind Reflexer Finance, a platform for minting stablecoins backed by crypto collateral, says \"HAI, a decentralized, community-governed, controlled-peg stablecoin and lending protocol built on Optimism,\" will go live on Optimism Mainnet on Feb. 20. According to the team: \"The project will airdrop tokens to qualifying wallets on Feb. 12.\"\nNibiru Chain Raises $12M From Kraken Ventures, ArkStream, NGC, Master, Tribe, Ban\nFeb. 5: Nibiru Chain, a developer-focused Layer-1 chain, has raised $12 million funding from Kraken Ventures, ArkStream, NGC, Master Ventures, Tribe Capital and Banter Capital to accelerate its ecosystem growth, according to the team: \"Nibiru optimizes for developers with a built-in dev toolkit, easy-to-use APIs, language SDKs, and a native oracle. It offers 40,000 TPS, 1.4s block times, and robust security, thanks in part to the CosmWasm smart contracts. Its built-in DeFi super applications, along with native oracle and data-indexing functionalities, significantly reduce the technical selection difficulties for DeFi projects.\"\nFilecoin's Liquid Staker Glif Raises $4.5M, Hints at Token Airdrop\nFeb. 5: Data storage-centric blockchain Filecoin isn’t exactly known for its decentralized finance (DeFi) landscape. Glif, one of its longtime ecosystem contributors, is trying to change that. The startup has raised $4.5 million in seed funding from Multicoin Capital and other VCs to build out its tools for earning yield on FIL, Filecoin’s “gas” token that pays for data storage and retrieval on the network. CoinDesk 20 asset: {FIL}\nRadix Launches Ecosystem Fund for Developers Worth More Than $1M\nFeb. 5: Radix has launched a 25 million XRD Ecosystem Fund to accelerate the growth of its builders' community, according to the team: \"Currently worth over US$1 million, the fund will support new activities, rewards and grants to developers and entrepreneurs in the ecosystem. These include developer incentives of up to $1,500 in XRD, milestone rewards as well as Booster grants for co-marketing and partnership opportunities. The fund will also be funneled towards Radix’s upcoming Scrypto challenges and the second cohort of the Radix Grants Program.\"\nWeb Registry GoDaddy, Ethereum Name Service Connect Domain Names With Crypto Wallets\nFeb. 5: Ethereum Name Service (ENS), a domain name protocol that runs atop of Ethereum, reached an agreement with GoDaddy to allow users to link internet domains to their ENS addresses for free. “Beyonce owns Beyonce.xyz, and now she can set up a wallet just by going into the GoDaddy page and entering your address,” Nick Johnson, the founder of ENS, told CoinDesk as an example. “Now Beyonce.xyz is her wallet identifier for all intents and purposes.”\nCrypto Payments App Oobit Raises $25M in Series A Funding Round Led by Tether\nFeb. 5: Mobile payments app Oobit raised $25 million in a Series A funding round, the company said Monday. The round was led by the investment arm of Tether, CMCC Global’s Titan Fund, 468 Capital and Solana co-founder Anatoly Yakovenko. Consumers can use the Oobit app to pay for purchases using crypto, while merchants receive fiat currency. The tap-and-pay feature helps make crypto payments more accessible, as users can pay at any point of sale that accepts Visa (V) or MasterCard (MA) using funds from their Oobit wallet.\nKodiak Finance, Berachain-Based DEX Project, Raises $2M\nFeb. 2: Kodiak Finance, aiming to becoming the \"community-native DEX of Berachain,\" announced the close of a $2 million seed financing round. According to the team: \"The funding will further enable us to increase the pace at which we scale Kodiak and allow us to continue delivering amazing trading products native to Berachain.\"\nStaking Service Luganodes Adds Support for Bitcoin L2 Stacks\nFeb. 1: Luganodes, provider of an institutional-grade staking service, is \"bringing its muscle\" to Stacks, a Bitcoin layer-2 network, according to the team: \"This means institutions can now easily earn native BTC rewards while supporting the network and enjoying faster, cheaper transactions with complete Bitcoin security. Luganodes will also be a Signer on the upcoming Nakamoto upgrade, solidifying its commitment to the Stacks ecosystem.\" According to a blog post, Luganodes \"ranks among the top validators on Polygon, Polkadot, Sui and Tron.\"\nPyth Deploys 'Pyth Entropy,' for On-Chain Random Number Generation\nFeb. 1: Pyth, a blockchain oracle project, announced the future deployment of Pyth Entropy, \"aimed at enhancing on-chain random number generation across various Web3 verticals such as prediction markets and GameFi,\" according to the team: \"The announcement marks a significant milestone as Pyth Entropy is primed to launch on a blockchain on mainnet for the first time, ushering in a new era for decentralized applications. Additionally, Pyth has unveiled the mainnet deployment of Pyth Price Feeds on LightLink, an Ethereum layer-2 blockchain. This now enables dApps and enterprises to offer users instant, gasless transactions. Starting today, smart contract developers in the LightLink ecosystem can permissionlessly access over 400 real-time price feeds across major asset classes to power their DeFi applications.\"\nCube.Exchange Raises $12M From Investors Including 6th Man, Asymmetric\nFeb. 1: Cube.Exchange, a soon-to-launch digital asset trading platform, has raised $12 million as part of a Series A fundraise, according to the team: \"Investors in the round, led by 6th Man Ventures, include Asymmetric, ParaFi Digital, Foundation Capital, Susquehanna Private Equity Investments, LLLP, GSR Markets, Everstake Capital, Big Brain Holdings, Third Kind Venture Capital, Arche Fund, WW Ventures and prominent angels. Proceeds will be used to expand engineering, customer service, operations, legal and compliance, business development; and to obtain licenses.\" This raise came as a result of inbound interest, according to the company, and comes on top of a $9 million seed round announced in October.\nSanctor Capital Raises $10M for Early Stage Web3 Fund\nFeb. 1: Sanctor Capital raised $10 million for its early stage Web3 investment fund, according to the team: \"It is also announcing a partnership with Press Start to launch a pre-accelerator program called The Multiplayer Fellowship. Together, Sanctor and Press Start aim to fund 100 teams over the next 18 months. Half of the graduates of Press Start’s previous fellowship programs have gone on to raise or join top accelerators such as Alliance DAO, a16z Crypto Startup School & SPEEDRUN, Binance Labs and Y Combinator.\"\nUpshot Unveils Allora, a Network for 'Self-Improving Decentralized AI'\nFeb. 1: Upshot unveiled Allora, a new \"trustless, self-improving decentralized AI network,\" according to the team. \"Allora is designed to empower applications with smarter, more secure AI through a self-improving network of machine learning models. Upshot is backed by industry investors including Polychain, Framework, Blockchain Capital, and CoinFund.\"\nPrediction Market Zeitgeist Launches DLMSR-Based AMM\nFeb. 1: Zeitgeist, a prediction market dApp, launched its DLMSR (Dynamic Logarithmic Market Scoring Rule) based automated market maker (AMM), according to the team, \"marking a significant advancement in the blockchain prediction market with a dynamic liquidity model previously unseen in the industry. The DLMSR model represents a first-of-its-kind application in blockchain technology, enhancing the flexibility of market creation and liquidity provision while drastically improving operational dynamics by reducing slippage and thereby transforming trading efficiency and profitability, especially in larger trades.\"\nWOOFi, Cross-Chain DEX, Launches on Mantle Network\nFeb. 1: WOOFi, a cross-chain DEX based in Saint Vincent and the Grenadines, has launched on Mantle Network, the Ethereum layer-2 scaling solution, according to the team: \"This positions WOOFi as one of the first protocols to support LayerZero-powered cross-chain swaps into Mantle from eight top chains, including Arbitrum, Optimism, and Avalanche. Mantle's MAU hit 370k in Jan 2024 post-LSP launch. VP of Ecosystem Ben Yorke notes the expected rise is fueled by easier mETH access, with WOOFi pivotal for its hyper-efficient cross-chain swaps, comprising 3.7% of LayerZero transactions.\"",
    "date": "2024-02-07",
    "author": "bradley keoun",
    "tagList": [
      "the protocol",
      "blockchain",
      "ethereum",
      "bitcoin",
      "tech",
      "blockchain technology",
      "evm",
      "protocol village"
    ]
  },
  {
    "link": "https://www.coindesk.com/tech/2023/09/06/anoma-foundation-plans-native-blockchain-for-privacy-focused-namada-protocol/",
    "type": "news article",
    "title": "Anoma Foundation Plans to Launch Privacy-Focused Namada Blockchain",
    "summary": "The mainnet joins the ranks of at least 50 other blockchains in the crypto ecosystem as of Tuesday.",
    "content": "KOREA BLOCKCHAIN WEEK, SEOUL — Blockchain non-profit Anoma Foundation today said it plans to create a standalone privacy-focused blockchain Namada that would support private transactions and features for any existing applications or networks.\nNamada co-founder Awa Sun Yin revealed the plans at the Korea Blockchain Week (KBW) in Seoul, attended by CoinDesk. Namada would join the increasingly competitive and crowded ranks of over 50 other blockchains but differs with its privacy-focused approach.\nNamada is a blockchain protocol with a focus on privacy. It uses a technology called zero-knowledge cryptography that allows users to transfer fungible or non-fungible assets from Ethereum or Cosmos networks without revealing their addresses or other on-chain footprints.\nThe protocol lets developers or users attach its privacy features to any existing assets, decentralized applications, and or even entire blockchain networks—without requiring alterations to their existing codebase.\n“The lack of privacy in crypto is becoming an existentially threatening centralization point,” said Awa Sun Yin, co-founder of Namada, during a KBW panel. “In recent years, we’ve seen large improvements in cryptography, combined with a more mature and growing multichain landscape – making it possible to make the best privacy accessible for any user.\"\n“At this point, making privacy practical for anyone in crypto is no longer rocket science – it’s a matter of prioritization,” Awa added.\nThe Namada mainnet launch is scheduled for Q4 this year, representatives told CoinDesk in a follow-up message.\nUPDATE (Sept. 14, 05:35 UTC): Corrects to say Namada is a standalone blockchain and not a protocol. Adds details.",
    "date": "2023-09-06",
    "author": "shaurya malwa",
    "tagList": [
      "defi",
      "blockchain"
    ]
  },
  {
    "link": "https://www.coindesk.com/policy/2023/11/30/embargo-6-am-ist-nov-30-or-730-pm-est-nov-29-the-algorand-foundation-expands-its-footprint-in-india/",
    "type": "news article",
    "title": "The Algorand Foundation Expands Its Footprint in India",
    "summary": "The foundation's AlgoBharat initiative has secured new partnerships in India with NASSCOM, TiE Bangalore and the Mann Deshi Foundation.",
    "content": "Blockchain protocol Algorand (ALGO) has expanded its footprint in India by securing new partnerships with NASSCOM, India's trade body and chamber of commerce for the tech industry, TiE Bangalore, a global venture supporting entrepreneurs, and the Mann Deshi Foundation which supports India's first rural bank for women.\nEarlier this year, the Algorand Foundation branched into India with its initiative called AlgoBharat. The word Bharat represents the nation of India. At the time, Algorand partnered with Self Employed Women’s Association (SEWA) to support women-led enterprises building blockchain solutions and with Jawaharlal Nehru Technological University and the Indian School of Business to launch faculty development programs.\nIt will now build out the Web3 capabilities of youngsters under NASSCOM's FutureSkills Prime skilling hub and develop a blockchain-based credit scorecard and identity system for Mann Deshi Foundation's women entrepreneurs, Algorand Foundation's CEO Staci Warden and India Country Head Anil Kakani told CoinDesk in an interview.\n\"In just a year, our strategic collaborations and innovative blockchain solutions with key players (in India) have pioneered financial inclusion, with the potential for impacting millions of lives in underserved communities,\" Warden said.\nThe blockchain protocol has also landed a new collaboration with TiE Bangalore, a global venture supporting entrepreneurs, to provide educational initiatives to support the Indian Web3 ecosystem.\nKakani said we are working on two types of partnerships – organizational to deepen India's Web3 foundation including broadening the developer base and then partnerships to build use cases.\n\"We are not going to regulators with recommendations but we are waiting for (India's) central bank digital currency (CBDC) to happen,\" Kakani told CoinDesk. \"We want to see how we can build on that but as a protocol, our heavy focus is real-world utility.\"\nAlgorand's earlier partnership with T-Hub to simply support startups will now include the launch of \"Startup Labs,\" a program that will offer mentorship for 20 Web3 startups. T-hub is a tech incubator led by the Telangana government, a state in south India.\nWith SEWA, Algorand has launched a pilot to help women earn high-value carbon credits through data it will collect via a blockchain-based solution.\nRead More: India’s Crypto Industry Finally Sees Lawmakers Engaging",
    "date": "2023-11-30",
    "author": "amitoj singh",
    "tagList": [
      "regulations",
      "algorand foundation",
      "blockchain",
      "india",
      "nasscom"
    ]
  }
]